TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed Jan 22 15:42:10 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DAB_500W.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("F:\BaiduNetdiskDownload\workspace\DAB_500W\CPU1_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__error__")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("__error__")

C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  127

    6304                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    6305              $C$DW$407       .dwtag  DW_TAG_subrange_type
    6306                      .dwattr $C$DW$407, DW_AT_upper_bound(0x01)
    6307              
    6308                      .dwendtag $C$DW$T$19
    6309              
    6310                      .dwendtag $C$DW$TU$19
    6311              
    6312              
    6313              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    6314                      .dwmtype  $C$DW$T$21
    6315              $C$DW$T$21      .dwtag  DW_TAG_typedef
    6316                      .dwattr $C$DW$T$21, DW_AT_name("float32_t")
    6317                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$16)
    6318                      .dwattr $C$DW$T$21, DW_AT_decl_file("D:\ti\c2000\C2000Ware_5_04_00_00\driverlib\f28003x\driverlib\inc
    6319                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x64)
    6320                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x17)
    6321              
    6322                      .dwendtag $C$DW$TU$21
    6323              
    6324              
    6325              $C$DW$TU$17     .dwtag  DW_TAG_type_unit
    6326                      .dwmtype  $C$DW$T$17
    6327              $C$DW$T$17      .dwtag  DW_TAG_base_type
    6328                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6329                      .dwattr $C$DW$T$17, DW_AT_name("double")
    6330                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    6331              
    6332                      .dwendtag $C$DW$TU$17
    6333              
    6334              
    6335              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    6336                      .dwmtype  $C$DW$T$94
    6337              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    6338                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$17)
    6339                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    6340              
    6341                      .dwendtag $C$DW$TU$94
    6342              
    6343              
    6344              $C$DW$TU$18     .dwtag  DW_TAG_type_unit
    6345                      .dwmtype  $C$DW$T$18
    6346              $C$DW$T$18      .dwtag  DW_TAG_base_type
    6347                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6348                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    6349                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    6350              
    6351                      .dwendtag $C$DW$TU$18
    6352              
    6353              
    6354              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    6355                      .dwmtype  $C$DW$T$95
    6356              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    6357                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$18)
    6358                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  128

    6359              
    6360                      .dwendtag $C$DW$TU$95
    6361              
    6362              
    6363              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    6364                      .dwmtype  $C$DW$T$48
    6365              $C$DW$408       .dwtag  DW_TAG_TI_far_type
    6366                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$5)
    6367              
    6368              $C$DW$T$48      .dwtag  DW_TAG_const_type
    6369                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$408)
    6370              
    6371                      .dwendtag $C$DW$TU$48
    6372              
    6373              
    6374              $C$DW$TU$49     .dwtag  DW_TAG_type_unit
    6375                      .dwmtype  $C$DW$T$49
    6376              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6377                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6378                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    6379              
    6380                      .dwendtag $C$DW$TU$49
    6381              
    6382              
    6383              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    6384                      .dwmtype  $C$DW$T$102
    6385              $C$DW$T$102     .dwtag  DW_TAG_base_type
    6386                      .dwattr $C$DW$T$102, DW_AT_encoding(DW_ATE_unsigned_char)
    6387                      .dwattr $C$DW$T$102, DW_AT_name("unsigned char")
    6388                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x01)
    6389              
    6390                      .dwendtag $C$DW$TU$102
    6391              
    6392              
    6393              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    6394                      .dwmtype  $C$DW$T$24
    6395              
    6396              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6397                      .dwattr $C$DW$T$24, DW_AT_name("dcl_css")
    6398                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    6399              $C$DW$409       .dwtag  DW_TAG_member
    6400                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$21)
    6401                      .dwattr $C$DW$409, DW_AT_name("tpt")
    6402                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6403                      .dwattr $C$DW$409, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6404                      .dwattr $C$DW$409, DW_AT_decl_line(0xc1)
    6405                      .dwattr $C$DW$409, DW_AT_decl_column(0x0f)
    6406              
    6407              $C$DW$410       .dwtag  DW_TAG_member
    6408                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$21)
    6409                      .dwattr $C$DW$410, DW_AT_name("T")
    6410                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6411                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6412                      .dwattr $C$DW$410, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6413                      .dwattr $C$DW$410, DW_AT_decl_line(0xc2)
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  129

    6414                      .dwattr $C$DW$410, DW_AT_decl_column(0x0f)
    6415              
    6416              $C$DW$411       .dwtag  DW_TAG_member
    6417                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$23)
    6418                      .dwattr $C$DW$411, DW_AT_name("sts")
    6419                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6420                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6421                      .dwattr $C$DW$411, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6422                      .dwattr $C$DW$411, DW_AT_decl_line(0xc3)
    6423                      .dwattr $C$DW$411, DW_AT_decl_column(0x0e)
    6424              
    6425              $C$DW$412       .dwtag  DW_TAG_member
    6426                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    6427                      .dwattr $C$DW$412, DW_AT_name("err")
    6428                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6429                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6430                      .dwattr $C$DW$412, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6431                      .dwattr $C$DW$412, DW_AT_decl_line(0xc4)
    6432                      .dwattr $C$DW$412, DW_AT_decl_column(0x0e)
    6433              
    6434              $C$DW$413       .dwtag  DW_TAG_member
    6435                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    6436                      .dwattr $C$DW$413, DW_AT_name("loc")
    6437                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6438                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6439                      .dwattr $C$DW$413, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6440                      .dwattr $C$DW$413, DW_AT_decl_line(0xc5)
    6441                      .dwattr $C$DW$413, DW_AT_decl_column(0x0e)
    6442              
    6443                      .dwattr $C$DW$T$24, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6444                      .dwattr $C$DW$T$24, DW_AT_decl_line(0xc0)
    6445                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    6446                      .dwendtag $C$DW$T$24
    6447              
    6448                      .dwendtag $C$DW$TU$24
    6449              
    6450              
    6451              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    6452                      .dwmtype  $C$DW$T$27
    6453              $C$DW$T$27      .dwtag  DW_TAG_typedef
    6454                      .dwattr $C$DW$T$27, DW_AT_name("DCL_CSS")
    6455                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    6456                      .dwattr $C$DW$T$27, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6457                      .dwattr $C$DW$T$27, DW_AT_decl_line(0xc6)
    6458                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    6459              
    6460                      .dwendtag $C$DW$TU$27
    6461              
    6462              
    6463              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    6464                      .dwmtype  $C$DW$T$28
    6465              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    6466                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    6467                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    6468              
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  130

    6469                      .dwendtag $C$DW$TU$28
    6470              
    6471              
    6472              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6473                      .dwmtype  $C$DW$T$29
    6474              
    6475              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6476                      .dwattr $C$DW$T$29, DW_AT_name("dcl_pi")
    6477                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x16)
    6478              $C$DW$414       .dwtag  DW_TAG_member
    6479                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$21)
    6480                      .dwattr $C$DW$414, DW_AT_name("Kp")
    6481                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6482                      .dwattr $C$DW$414, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6483                      .dwattr $C$DW$414, DW_AT_decl_line(0x1cf)
    6484                      .dwattr $C$DW$414, DW_AT_decl_column(0x0f)
    6485              
    6486              $C$DW$415       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    6488                      .dwattr $C$DW$415, DW_AT_name("Ki")
    6489                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6490                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6491                      .dwattr $C$DW$415, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6492                      .dwattr $C$DW$415, DW_AT_decl_line(0x1d0)
    6493                      .dwattr $C$DW$415, DW_AT_decl_column(0x0f)
    6494              
    6495              $C$DW$416       .dwtag  DW_TAG_member
    6496                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    6497                      .dwattr $C$DW$416, DW_AT_name("i10")
    6498                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6499                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6500                      .dwattr $C$DW$416, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6501                      .dwattr $C$DW$416, DW_AT_decl_line(0x1d1)
    6502                      .dwattr $C$DW$416, DW_AT_decl_column(0x0f)
    6503              
    6504              $C$DW$417       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$21)
    6506                      .dwattr $C$DW$417, DW_AT_name("Umax")
    6507                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6508                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6509                      .dwattr $C$DW$417, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6510                      .dwattr $C$DW$417, DW_AT_decl_line(0x1d2)
    6511                      .dwattr $C$DW$417, DW_AT_decl_column(0x0f)
    6512              
    6513              $C$DW$418       .dwtag  DW_TAG_member
    6514                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$21)
    6515                      .dwattr $C$DW$418, DW_AT_name("Umin")
    6516                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6517                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6518                      .dwattr $C$DW$418, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6519                      .dwattr $C$DW$418, DW_AT_decl_line(0x1d3)
    6520                      .dwattr $C$DW$418, DW_AT_decl_column(0x0f)
    6521              
    6522              $C$DW$419       .dwtag  DW_TAG_member
    6523                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  131

    6524                      .dwattr $C$DW$419, DW_AT_name("i6")
    6525                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6526                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6527                      .dwattr $C$DW$419, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6528                      .dwattr $C$DW$419, DW_AT_decl_line(0x1d4)
    6529                      .dwattr $C$DW$419, DW_AT_decl_column(0x0f)
    6530              
    6531              $C$DW$420       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$21)
    6533                      .dwattr $C$DW$420, DW_AT_name("i11")
    6534                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6535                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6536                      .dwattr $C$DW$420, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6537                      .dwattr $C$DW$420, DW_AT_decl_line(0x1d5)
    6538                      .dwattr $C$DW$420, DW_AT_decl_column(0x0f)
    6539              
    6540              $C$DW$421       .dwtag  DW_TAG_member
    6541                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$21)
    6542                      .dwattr $C$DW$421, DW_AT_name("Imax")
    6543                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6544                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6545                      .dwattr $C$DW$421, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6546                      .dwattr $C$DW$421, DW_AT_decl_line(0x1d6)
    6547                      .dwattr $C$DW$421, DW_AT_decl_column(0x0f)
    6548              
    6549              $C$DW$422       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    6551                      .dwattr $C$DW$422, DW_AT_name("Imin")
    6552                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6553                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6554                      .dwattr $C$DW$422, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6555                      .dwattr $C$DW$422, DW_AT_decl_line(0x1d7)
    6556                      .dwattr $C$DW$422, DW_AT_decl_column(0x0f)
    6557              
    6558              $C$DW$423       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$26)
    6560                      .dwattr $C$DW$423, DW_AT_name("sps")
    6561                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6562                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6563                      .dwattr $C$DW$423, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6564                      .dwattr $C$DW$423, DW_AT_decl_line(0x1d8)
    6565                      .dwattr $C$DW$423, DW_AT_decl_column(0x11)
    6566              
    6567              $C$DW$424       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$28)
    6569                      .dwattr $C$DW$424, DW_AT_name("css")
    6570                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6571                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6572                      .dwattr $C$DW$424, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6573                      .dwattr $C$DW$424, DW_AT_decl_line(0x1d9)
    6574                      .dwattr $C$DW$424, DW_AT_decl_column(0x0e)
    6575              
    6576                      .dwattr $C$DW$T$29, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6577                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x1ce)
    6578                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  132

    6579                      .dwendtag $C$DW$T$29
    6580              
    6581                      .dwendtag $C$DW$TU$29
    6582              
    6583              
    6584              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    6585                      .dwmtype  $C$DW$T$70
    6586              $C$DW$T$70      .dwtag  DW_TAG_typedef
    6587                      .dwattr $C$DW$T$70, DW_AT_name("DCL_PI")
    6588                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$29)
    6589                      .dwattr $C$DW$T$70, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6590                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x1da)
    6591                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    6592              
    6593                      .dwendtag $C$DW$TU$70
    6594              
    6595              
    6596              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    6597                      .dwmtype  $C$DW$T$71
    6598              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6599                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6600                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    6601              
    6602                      .dwendtag $C$DW$TU$71
    6603              
    6604              
    6605              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    6606                      .dwmtype  $C$DW$T$30
    6607              
    6608              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6609                      .dwattr $C$DW$T$30, DW_AT_name("dcl_pi_sps")
    6610                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
    6611              $C$DW$425       .dwtag  DW_TAG_member
    6612                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    6613                      .dwattr $C$DW$425, DW_AT_name("Kp")
    6614                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6615                      .dwattr $C$DW$425, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6616                      .dwattr $C$DW$425, DW_AT_decl_line(0x1c0)
    6617                      .dwattr $C$DW$425, DW_AT_decl_column(0x0f)
    6618              
    6619              $C$DW$426       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$21)
    6621                      .dwattr $C$DW$426, DW_AT_name("Ki")
    6622                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6623                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6624                      .dwattr $C$DW$426, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6625                      .dwattr $C$DW$426, DW_AT_decl_line(0x1c1)
    6626                      .dwattr $C$DW$426, DW_AT_decl_column(0x0f)
    6627              
    6628              $C$DW$427       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$21)
    6630                      .dwattr $C$DW$427, DW_AT_name("Umax")
    6631                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6632                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6633                      .dwattr $C$DW$427, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  133

    6634                      .dwattr $C$DW$427, DW_AT_decl_line(0x1c2)
    6635                      .dwattr $C$DW$427, DW_AT_decl_column(0x0f)
    6636              
    6637              $C$DW$428       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$21)
    6639                      .dwattr $C$DW$428, DW_AT_name("Umin")
    6640                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6641                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6642                      .dwattr $C$DW$428, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6643                      .dwattr $C$DW$428, DW_AT_decl_line(0x1c3)
    6644                      .dwattr $C$DW$428, DW_AT_decl_column(0x0f)
    6645              
    6646              $C$DW$429       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$21)
    6648                      .dwattr $C$DW$429, DW_AT_name("Imax")
    6649                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6650                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6651                      .dwattr $C$DW$429, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6652                      .dwattr $C$DW$429, DW_AT_decl_line(0x1c4)
    6653                      .dwattr $C$DW$429, DW_AT_decl_column(0x0f)
    6654              
    6655              $C$DW$430       .dwtag  DW_TAG_member
    6656                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$21)
    6657                      .dwattr $C$DW$430, DW_AT_name("Imin")
    6658                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6659                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6660                      .dwattr $C$DW$430, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/includ
    6661                      .dwattr $C$DW$430, DW_AT_decl_line(0x1c5)
    6662                      .dwattr $C$DW$430, DW_AT_decl_column(0x0f)
    6663              
    6664                      .dwattr $C$DW$T$30, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6665                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x1bf)
    6666                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    6667                      .dwendtag $C$DW$T$30
    6668              
    6669                      .dwendtag $C$DW$TU$30
    6670              
    6671              
    6672              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    6673                      .dwmtype  $C$DW$T$25
    6674              $C$DW$T$25      .dwtag  DW_TAG_typedef
    6675                      .dwattr $C$DW$T$25, DW_AT_name("DCL_PI_SPS")
    6676                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$30)
    6677                      .dwattr $C$DW$T$25, DW_AT_decl_file("D:/ti/c2000/C2000Ware_5_04_00_00/libraries/control/DCL/c28/inclu
    6678                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x1c6)
    6679                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    6680              
    6681                      .dwendtag $C$DW$TU$25
    6682              
    6683              
    6684              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    6685                      .dwmtype  $C$DW$T$26
    6686              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    6687                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    6688                      .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.1 Wed Jan 22 15:42:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Admin\AppData\Local\Temp\{993C79F2-1F99-40CD-A4A1-8E0E3AAA890F} PAGE  134

    6689              
    6690                      .dwendtag $C$DW$TU$26
    6691              

No Assembly Errors, No Assembly Warnings
